Ian-Macallan/WOE5Extract/WOE5Extract/MCXNCColor.cpp
#include "stdafx.h"
#include <afxtoolbar.h>

#include "resource.h"

#include "MCXNCColor.h"
#include "MCXColors.h"

#include "MCXMenuBase.h"
#include "MCXGDI.h"

#include "MCXCWndBase.h"
#include "MCXViewBase.h"
#include "MCXDialogBase.h"
#include "MCXDialogExBase.h"
#include "MCXFrameWndBase.h"
#include "MCXMDIFrameWndBase.h"
#include "MCXMDIChildWndBase.h"

#include "MCXPropertySheetBase.h"
#include "MCXPropertyPageBase.h"

#include "MCXWinAppBase.h"
#include "MCXIcons.h"

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetFrameFullRect ( const CRect &windowRECT )
{
    CRect frameFullRECT;
    frameFullRECT.left      = 0;
    frameFullRECT.top       = 0;
    frameFullRECT.right     = windowRECT.Width();
    frameFullRECT.bottom    = windowRECT.Height();
    return frameFullRECT;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetCaptionWindowRect ( CWnd *pWnd )
{
        //
    CRect windowRECT;
    pWnd->GetWindowRect(&windowRECT);

    //  EG : 1
    int yBorder         = GetSystemMetrics ( SM_CYBORDER );

    //  EG : 3
    int yFrame          = GetSystemMetrics ( SM_CYDLGFRAME );

    int yCaption        = GetSystemMetrics ( SM_CYCAPTION );

    CRect captionFullRECT;

    captionFullRECT.left    = windowRECT.left;
    captionFullRECT.top     = windowRECT.top;
    captionFullRECT.right   = captionFullRECT.left + windowRECT.Width();
    captionFullRECT.bottom  = captionFullRECT.top + yCaption + 2 * yBorder + yFrame;

    return captionFullRECT;


}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetCaptionFullRect ( const CRect &windowRECT )
{
    //  EG : 1
    int yBorder         = GetSystemMetrics ( SM_CYBORDER );

    //  EG : 3
    int yFrame          = GetSystemMetrics ( SM_CYDLGFRAME );

    int yCaption        = GetSystemMetrics ( SM_CYCAPTION );

    CRect captionFullRECT;

    captionFullRECT.left    = 1;
    captionFullRECT.top     = 1;
    captionFullRECT.right   = windowRECT.Width() - 1;
    captionFullRECT.bottom  = yCaption + 2 * yBorder + yFrame;

    return captionFullRECT;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetCaptionInsideRect ( const CRect &windowRECT )
{
    //  EG : 1
    int xBorder         = GetSystemMetrics ( SM_CXBORDER );
    int yBorder         = GetSystemMetrics ( SM_CYBORDER );

    //  EG : 3
    int xFrame          = GetSystemMetrics ( SM_CXDLGFRAME );
    int yFrame          = GetSystemMetrics ( SM_CYDLGFRAME );

    int yCaption        = GetSystemMetrics ( SM_CYCAPTION );

    int xLeft           = xBorder + xFrame;
    int yTop            = yBorder + yFrame;

    int x               = xLeft;
    int y               = yTop;
    int cx              = windowRECT.Width() - 2 * xFrame - xBorder;
    int cy              = yCaption + yBorder + yFrame;

    CRect   captionInsideRECT;
    captionInsideRECT.left      = x; 
    captionInsideRECT.top       = y;
    captionInsideRECT.right     = captionInsideRECT.left + cx;
    captionInsideRECT.bottom    = captionInsideRECT.top + cy;
    return captionInsideRECT;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetMenuBarRect ( HWND hWnd, const CRect &windowRECT )
{
    CRect menuBarRECT;

    //
    //  Menu Bar
    MENUBARINFO mbi;
    ZeroMemory ( &mbi, sizeof(mbi) );
    mbi.cbSize  = sizeof(mbi) ;

    ::GetMenuBarInfo ( hWnd, OBJID_MENU, 0, &mbi );

    menuBarRECT.left    = mbi.rcBar.left - windowRECT.left;
    menuBarRECT.top     = mbi.rcBar.top - windowRECT.top;
    menuBarRECT.right   = menuBarRECT.left + mbi.rcBar.right - mbi.rcBar.left;
    menuBarRECT.bottom  = menuBarRECT.top + mbi.rcBar.bottom - mbi.rcBar.top;

    return menuBarRECT;
}

//
/////////////////////////////////////////////////////////////////////////////
//  Only left and top are correct
//  Bottom and right are same as left and top
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetToolBarRect ( CToolBar *pToolBar, const CRect &windowRECT )
{
    //
    CRect toolBarRect;

    RECT rect;
    pToolBar->GetWindowRect ( &rect );

    toolBarRect.left    = rect.left - windowRECT.left;
    toolBarRect.top     = rect.top - windowRECT.top;
    toolBarRect.right   = toolBarRect.left + rect.right - rect.left;
    toolBarRect.bottom  = toolBarRect.top + rect.bottom - rect.top;

    return toolBarRect;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetClientFullRect ( const CRect &windowRECT )
{
    //  EG : 1
    int xBorder         = GetSystemMetrics ( SM_CXBORDER );
    int yBorder         = GetSystemMetrics ( SM_CYBORDER );

    //  EG : 3
    int xFrame          = GetSystemMetrics ( SM_CXDLGFRAME );
    int yFrame          = GetSystemMetrics ( SM_CYDLGFRAME );

    int xIcon           = GetSystemMetrics ( SM_CXICON );
    int yIcon           = GetSystemMetrics ( SM_CYICON );

    int xIconSmall      = GetSystemMetrics ( SM_CXSMICON );
    int yIconSmall      = GetSystemMetrics ( SM_CYSMICON );

    int yCaption        = GetSystemMetrics ( SM_CYCAPTION );

    CRect clientFullRECT;

    clientFullRECT.top        = yBorder + yFrame + yCaption + yBorder;
    clientFullRECT.left       = 0;
    clientFullRECT.bottom     = windowRECT.Height();
    clientFullRECT.right      = windowRECT.Width();

    return clientFullRECT;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
int CMCXNCColor::GetIconWidth ( )
{
    int xIcon           = GetSystemMetrics ( SM_CXICON );
    return xIcon * 3 / 2 - 1;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
int CMCXNCColor::GetIconHeight ( )
{
    int yCaption        = GetSystemMetrics ( SM_CYCAPTION );
    return yCaption - 1;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CRect CMCXNCColor::GetIconFullRECT ( const CRect &windowRECT, int left )
{
    int yBorder         = GetSystemMetrics ( SM_CYBORDER );
    int yFrame          = GetSystemMetrics ( SM_CYDLGFRAME );

