Ian-Macallan/WOE5Extract/WOE5Extract/MCXNCColor.cpp
        DrawIconEx(pDC->m_hDC, crect.left + xMargin, crect.top + yMargin, hIcon, xIconSmall, yIconSmall, 0, NULL, DI_NORMAL);
    }
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CDC *CMCXNCColor::GetDeviceContext ( CWnd *pWnd )
{
    return  pWnd->GetWindowDC();
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::PaintCaption( CWnd *pWnd, BOOL bActive, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    if ( CMCXColors::m_iDarkTheme != 2 && CMCXColors::m_iDarkTheme != darkIndicator )
    {
        return FALSE;
    }

    //  EG : 1
    int xBorder         = GetSystemMetrics ( SM_CXBORDER );
    int yBorder         = GetSystemMetrics ( SM_CYBORDER );

    //  EG : 3
    int xFrame          = GetSystemMetrics ( SM_CXDLGFRAME );
    int yFrame          = GetSystemMetrics ( SM_CYDLGFRAME );

    // int xIcon           = GetSystemMetrics ( SM_CXICON );
    // int yIcon           = GetSystemMetrics ( SM_CYICON );

    // int xIconSmall      = GetSystemMetrics ( SM_CXSMICON );
    // int yIconSmall      = GetSystemMetrics ( SM_CYSMICON );

    // int yCaption        = GetSystemMetrics ( SM_CYCAPTION );

    int xLeft           = xBorder + xFrame;
    int yTop            = yBorder + yFrame;

    int iconWidth       = GetIconWidth();
    int iconHeight      = GetIconHeight();

    //
    CDC* pDC = GetDeviceContext ( pWnd );

    //
    CRect windowRECT;
    pWnd->GetWindowRect(&windowRECT);

    //
    COLORREF foregroundColor = CMCXColors::GetFGNormalCR(CMCXColors::m_iDarkTheme != 0);

    //  First Draw Frmae Rect Around the window
    CRect frameFullRECT     = GetFrameFullRect ( windowRECT );
    pDC->FrameRect ( &frameFullRECT, CMCXColors::GetCyanCBrush() );

    //  The The Caption Rect
    CRect captionFullRECT   = GetCaptionFullRect ( windowRECT );

    //
    if ( bActive )
    {
        pDC->FillSolidRect(&captionFullRECT, CMCXColors::GetBKSelectedCR(CMCXColors::m_iDarkTheme != 0));
    }
    else
    {
        pDC->FillSolidRect(&captionFullRECT, CMCXColors::GetBKNormalCR(CMCXColors::m_iDarkTheme != 0));
    }

    //
    //  Caption Rect
    CRect captionInsideRECT = GetCaptionInsideRect ( windowRECT );

    // Draw Old FRame (Window XP)
    UINT captionOption  = DFCS_CAPTIONMIN | DFCS_CAPTIONMAX | DFCS_CAPTIONCLOSE | DFCS_CAPTIONRESTORE | DFCS_CAPTIONHELP;
    captionOption       |= DFCS_FLAT;
    // pDC->DrawFrameControl ( captionInsideRECT, DFC_CAPTION, captionOption );

    TCHAR szTitle [ MAX_PATH ];
    pWnd->GetWindowText ( szTitle, _wsizeof(szTitle));
    CRect textRECT  = captionInsideRECT;
    textRECT.left   = textRECT.left + iconWidth + xBorder;

    pDC->SetBkMode (TRANSPARENT);
    pDC->SetTextColor (foregroundColor);
    pDC->DrawText ( szTitle, &textRECT, DT_LEFT | DT_VCENTER );

    //
    DWORD dwStyle = pWnd->GetStyle();
    WINDOWPLACEMENT wp;
    pWnd->GetWindowPlacement( &wp );

    //  ICONS
    //////////////////////////////

    //  LEFT
    m_IconRect = GetIconFullRECT ( windowRECT, 1 /* xLeft */ );
    if ( CMCXColors::m_iSquareCorner == 1 )
    {
        DrawIcon ( pDC, IDR_MAINFRAME, m_IconRect );
    }
    else
    {
        if ( ( dwStyle & WS_SYSMENU ) && ( dwStyle & WS_CAPTION ) )
        {
            DrawIcon ( pDC, IDR_MAINFRAME, m_IconRect );
        }
    }

    //  RIGHT
    // Close
    m_CloseRect = GetIconFullRECT ( windowRECT, /* captionInsideRECT.right */ captionFullRECT.right - iconWidth );
    if ( IDI_CLOSE != VAL_CLOSE )
    {
        DrawIcon ( pDC, IDI_CLOSE, m_CloseRect );

    }
    else if ( hIcon_close_ico != NULL )
    {
        DrawIcon ( pDC, hIcon_close_ico, m_CloseRect );
    }

    //  Maximize
    m_MaximizeRect = GetIconFullRECT ( windowRECT, m_CloseRect.left - iconWidth );
    if ( dwStyle & WS_MAXIMIZEBOX )
    {
        if ( wp.showCmd == SW_NORMAL )
        {
            if ( IDI_MAXIMIZE != VAL_MAXIMIZE )
            {
                DrawIcon ( pDC, IDI_MAXIMIZE, m_MaximizeRect );
            }
            else if ( hIcon_maximize_ico != NULL )
            {
                DrawIcon ( pDC, hIcon_maximize_ico, m_MaximizeRect );
            }
        }
        else
        {
            if ( IDI_WINDOWED != VAL_WINDOWED )
            {
                DrawIcon ( pDC, IDI_WINDOWED, m_MaximizeRect );
            }
            else if ( hIcon_windowed_ico != NULL )
            {
                DrawIcon ( pDC, hIcon_windowed_ico, m_MaximizeRect );
            }
        }
    }

    //  Minilmize
    m_MinimizeRect = GetIconFullRECT ( windowRECT, m_MaximizeRect.left - iconWidth );
    if ( dwStyle & WS_MINIMIZEBOX )
    {
        if ( IDI_MINIMIZE != VAL_MINIMIZE )
        {
            DrawIcon ( pDC, IDI_MINIMIZE, m_MinimizeRect );
        }
        else if ( hIcon_minimize_ico != NULL )
        {
            DrawIcon ( pDC, hIcon_minimize_ico, m_MinimizeRect );
        }
    }

    //
    pWnd->ReleaseDC ( pDC );

    return TRUE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::PaintWindow ( CWnd *pWnd, BOOL bFill, CToolBar *pToolBar, BOOL bActive, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    if ( CMCXColors::m_iDarkTheme != 2 && CMCXColors::m_iDarkTheme != darkIndicator )
    {
        return FALSE;
    }


    //
    CDC*    pDC     = GetDeviceContext ( pWnd );
    HWND    hWnd    = pWnd->m_hWnd;

    //
    //  Fill Background
    CRect windowRECT;
    pWnd->GetWindowRect(&windowRECT);

    //  First Draw Frmae Rect Around the window
    CRect frameFullRECT = GetFrameFullRect ( windowRECT );
    pDC->FrameRect ( &frameFullRECT, CMCXColors::GetCyanCBrush() );

    //
    //  Menu Bar
    // MENUBARINFO mbi;
    // ZeroMemory ( &mbi, sizeof(mbi) );
    // mbi.cbSize  = sizeof(mbi) ;

    //
    CRect   usedMenuBar;
    usedMenuBar.left    = 0xffff;
    usedMenuBar.top     = 0xffff;
    usedMenuBar.right   = 0;
    usedMenuBar.bottom  = 0;

    //
    CRect   usedToolBar;
    usedToolBar.left    = 0xffff;
    usedToolBar.top     = 0xffff;
    usedToolBar.right   = 0;
    usedToolBar.bottom  = 0;

    //
    if ( hWnd )
    {
        //  0 means full menu
        //  Rect In Screen Coord
        CRect menuBarRect = GetMenuBarRect ( hWnd, windowRECT );
        // ::GetMenuBarInfo ( hWnd, OBJID_MENU, 0, &mbi );

        //
        HMENU hMenu = ::GetMenu(hWnd);
        if ( hMenu != NULL )
        {
            int count = ::GetMenuItemCount(hMenu);
            RECT rectItem;

            for (int i = 0; i < count; i++ )
            {
                //  Retrieve Rect in Screen coordinates
                if (::GetMenuItemRect(hWnd, hMenu, i, &rectItem))
                {
                    if ( rectItem.left < usedMenuBar.left )
                    {
                        usedMenuBar.left = rectItem.left;
                    }
                    if ( rectItem.right > usedMenuBar.right )
                    {
                        usedMenuBar.right = rectItem.right;
                    }
                    if ( rectItem.top < usedMenuBar.top )
                    {
                        usedMenuBar.top = rectItem.top;
                    }
                    if ( rectItem.bottom > usedMenuBar.bottom )
                    {
                        usedMenuBar.bottom = rectItem.bottom;
                    }
                }
            }

            CRect fillRect = menuBarRect;
            fillRect.left = fillRect.left + usedMenuBar.right - usedMenuBar.left;
            pDC->FillRect ( &fillRect, CMCXColors::GetBKNormalCBrush(CMCXColors::m_iDarkTheme != 0) );
            
            // pDC->FillRect ( &fillRect, CMCXColors::GetBlueCBrush () );
        }

        //
        //  Tool Bar
        if ( pToolBar != NULL && pToolBar->m_hWnd != NULL )
        {
            CRect toolBarRect = GetToolBarRect (pToolBar, windowRECT );

            int nbButtons = pToolBar->GetCount();

            //
            for ( int i = 0; i < nbButtons; i++ )
            {
                RECT rectButton;
                pToolBar->GetItemRect ( i, &rectButton );
                if ( rectButton.left < usedToolBar.left )
                {
                    usedToolBar.left = rectButton.left;
                }
                if ( rectButton.right > usedToolBar.right )
                {
                    usedToolBar.right = rectButton.right;
                }
                if ( rectButton.top < usedToolBar.top )
                {
                    usedToolBar.top = rectButton.top;
                }
                if ( rectButton.bottom > usedToolBar.bottom )
                {
                    usedToolBar.bottom = rectButton.bottom;
                }
            }

            CRect fillRect  = toolBarRect;
            fillRect.left   = fillRect.left + usedToolBar.right - usedToolBar.left;
            fillRect.bottom = fillRect.bottom + usedToolBar.bottom - usedToolBar.top;
            fillRect.right  = windowRECT.Width();
            fillRect.bottom = windowRECT.Height();
            // pDC->FillRect ( &fillRect, CMCXColors::GetBKNormalCBrush(CMCXColors::m_iDarkTheme != 0) );
        }
    }

    //
    //  So We will rework this part
    //  Avoiding the menu and the icon bar

