Ian-Macallan/WOE5Extract/WOE5Extract/MCXNCColor.cpp
    //  The Following line mess the menu
    RECT clientFullRect = GetClientFullRect ( windowRECT );
    if ( bFill )
    {
        //
        pDC->FillRect ( &clientFullRect, CMCXColors::GetBKNormalCBrush(CMCXColors::m_iDarkTheme != 0) );
    }

    //
    pWnd->ReleaseDC ( pDC );

    //
    PaintCaption ( pWnd, bActive, darkIndicator );

    //
    {
        RECT clientRect;
        pWnd->GetClientRect( &clientRect );
        pWnd->InvalidateRect ( &clientRect );
    }
    return TRUE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::Activate( CWnd *pWnd, BOOL bActive, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    if ( CMCXColors::m_iDarkTheme != 2 && CMCXColors::m_iDarkTheme != darkIndicator )
    {
        return FALSE;
    }

    return PaintCaption ( pWnd, bActive, darkIndicator );
}


//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnNcLButtonDown(CWnd *pWnd, UINT nHitTest, CPoint point, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    if ( CMCXColors::m_iDarkTheme == 2 || CMCXColors::m_iDarkTheme == darkIndicator )
    {
        if ( ScreenPointOverRect( pWnd, point, m_IconRect ) )
        {
            //  Default Treatment
            if ( CMCXColors::m_iSquareCorner == 1 )
            {
                RECT clientRect;
                pWnd->GetClientRect ( &clientRect );
                pWnd->ClientToScreen ( &clientRect );
                CPoint pt;
                pt.x = clientRect.left;
                pt.y = clientRect.top;

                BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, pt, darkIndicator );
                return bTreated;
            }
            else
            {
                return FALSE;
            }
        }

        //
        else if ( ScreenPointOverRect( pWnd, point, m_CloseRect ) )
        {
            return TRUE;
        }

        else if ( ScreenPointOverRect( pWnd, point, m_MinimizeRect ) )
        {
            return TRUE;
        }

        else if ( ScreenPointOverRect( pWnd, point, m_MaximizeRect ) )
        {
            return TRUE;
        }

        //  Icons At RIght
        int xIcon   = GetSystemMetrics ( SM_CXICON );

        //
        CRect iconsRect;
        iconsRect.top       = m_CloseRect.top;
        iconsRect.bottom    = m_CloseRect.bottom;
        iconsRect.left      = min(min(m_CloseRect.left, m_MinimizeRect.left), m_MaximizeRect.left);
        iconsRect.right     = max(max(m_CloseRect.right, m_MinimizeRect.right), m_MaximizeRect.right);
        iconsRect.left      = iconsRect.left - xIcon;
        if ( ScreenPointOverRect( pWnd, point, iconsRect ) )
        {
            return TRUE;
        }

        //  We Could handle move here
        CRect windowRECT;
        pWnd->GetWindowRect(&windowRECT);
        CRect captionRect = GetCaptionFullRect ( windowRECT );
        if ( ScreenPointOverRect( pWnd, point, captionRect ) )
        {
            m_bLeftPressed      = FALSE;
            m_windowRECT        = windowRECT;
            m_LeftPressedPoint  = point;
            return m_bLeftPressed;
        }
    }

    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnNcLButtonUp(CWnd *pWnd, UINT nHitTest, CPoint point, int darkIndicator)
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    m_bLeftPressed  = FALSE;

	//
    //
    if ( CMCXColors::m_iDarkTheme == 2 || CMCXColors::m_iDarkTheme == darkIndicator )
    {
        if ( ScreenPointOverRect( pWnd, point, m_IconRect ) )
        {
            //  Default Treatment
            return FALSE;
        }

        else if ( ScreenPointOverRect( pWnd, point, m_CloseRect ) )
        {
            ::SendMessage ( pWnd->m_hWnd, WM_SYSCOMMAND, SC_CLOSE, NULL );
            return TRUE;
        }

        else if ( ScreenPointOverRect( pWnd, point, m_MinimizeRect ) )
        {
            //
            DWORD dwStyle = pWnd->GetStyle();
            WINDOWPLACEMENT wp;
            pWnd->GetWindowPlacement( &wp );
            if ( dwStyle & WS_MINIMIZEBOX )
            {
                ::SendMessage ( pWnd->m_hWnd, WM_SYSCOMMAND, SC_MINIMIZE, NULL );
            }
            return TRUE;
        }

        else if ( ScreenPointOverRect( pWnd, point, m_MaximizeRect ) )
        {
            //
            DWORD dwStyle = pWnd->GetStyle();
            WINDOWPLACEMENT wp;
            pWnd->GetWindowPlacement( &wp );
            if ( dwStyle & WS_MAXIMIZEBOX )
            {
                if ( wp.showCmd == SW_NORMAL )
                {
                    ::SendMessage ( pWnd->m_hWnd, WM_SYSCOMMAND, SC_MAXIMIZE, NULL );
                }
                else
                {
                    ::SendMessage ( pWnd->m_hWnd, WM_SYSCOMMAND, SC_RESTORE, NULL );
                }
            }
            return TRUE;
        }

        //  Icons At RIght
        int xIcon   = GetSystemMetrics ( SM_CXICON );

        CRect iconsRect;
        iconsRect.top       = m_CloseRect.top;
        iconsRect.bottom    = m_CloseRect.bottom;
        iconsRect.left      = min(min(m_CloseRect.left, m_MinimizeRect.left), m_MaximizeRect.left);
        iconsRect.right     = max(max(m_CloseRect.right, m_MinimizeRect.right), m_MaximizeRect.right);
        iconsRect.left      = iconsRect.left - xIcon;
        if ( ScreenPointOverRect( pWnd, point, iconsRect ) )
        {
            return TRUE;
        }

    }

    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::SetThemeChanged ( CWnd *pWnd )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    CMenu *pMenu = GetSystemMenu(pWnd, FALSE);

    if ( pMenu != NULL )
    {
        //  Square Corners
        if ( CMCXColors::m_iSquareCorner == 1 )
        {
            //  Dark Theme Full
            if ( CMCXColors::m_iDarkTheme == 2 )
            {
                CMCXColors::SetWindowTheme ( pWnd );
                //  Remove System Menu
                pWnd->ModifyStyle ( WS_SYSMENU, NULL, SWP_NOMOVE | SWP_NOSIZE | SWP_NOZORDER );
                CMCXMenuBase::SetOwnDraw ( pMenu->GetSubMenu(0), true, ID_SYS_MENU );
            }
            //  Dark Theme and Normal Theme
            else
            {
                CMCXColors::SetWindowTheme ( pWnd );
                //  Add System Menu
                pWnd->ModifyStyle ( NULL, WS_SYSMENU | WS_MINIMIZEBOX, SWP_NOMOVE | SWP_NOSIZE | SWP_NOZORDER );
                if ( false )
                {
                    DWORD dwStyle = GetWindowLong( pWnd->GetSafeHwnd(), GWL_STYLE );
                    dwStyle |= WS_SYSMENU | WS_MINIMIZEBOX;
                    SetWindowLong( pWnd->GetSafeHwnd(), GWL_STYLE, dwStyle );
                }
                CMCXMenuBase::SetOwnDraw ( pMenu->GetSubMenu(0), false, ID_SYS_MENU );

                pWnd->SetWindowPos ( NULL, 0, 0, 0, 0, SWP_NOMOVE | SWP_NOSIZE | SWP_NOZORDER );
            }
	    }
        //  No Square Corners
        else
        {
            CMCXColors::SetWindowTheme ( pWnd );

            //  Add System Menu
            pWnd->ModifyStyle ( NULL, WS_SYSMENU | WS_MINIMIZEBOX, SWP_NOMOVE | SWP_NOSIZE | SWP_NOZORDER );
            if ( false )
            {
                DWORD dwStyle = GetWindowLong( pWnd->GetSafeHwnd(), GWL_STYLE );
                dwStyle |= WS_SYSMENU | WS_MINIMIZEBOX;
                SetWindowLong( pWnd->GetSafeHwnd(), GWL_STYLE, dwStyle );
            }

            if ( CMCXColors::m_iDarkTheme == 2 || CMCXColors::m_iDarkTheme == 1 )
            {
                if ( pMenu )
                {
                    CMCXMenuBase::SetOwnDraw ( pMenu->GetSubMenu(0), true, ID_SYS_MENU );
                }
            }
            else
            {
                if ( pMenu )
                {
                    CMCXMenuBase::SetOwnDraw ( pMenu->GetSubMenu(0), false, ID_SYS_MENU );
                }
            }

            pWnd->SetWindowPos ( NULL, 0, 0, 0, 0, SWP_NOMOVE | SWP_NOSIZE | SWP_NOZORDER );

