Ian-Macallan/WOE5Extract/WOE5Extract/MCXNCColor.cpp
        }

        //
        if ( CMCXColors::m_iDarkTheme == 0 )
        {
            //
            {
                CMCXPropertySheetBase *pSheet = dynamic_cast<CMCXPropertySheetBase *>(pWnd);
                if ( pSheet != NULL )
                {
                    pSheet->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXPropertyPageBase *pPage = dynamic_cast<CMCXPropertyPageBase *>(pWnd);
                if ( pPage != NULL )
                {
                    pPage->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXDialogExBase *pDialogEx = dynamic_cast<CMCXDialogExBase *>(pWnd);
                if ( pDialogEx != NULL )
                {
                    pDialogEx->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXDialogBase *pDialog = dynamic_cast<CMCXDialogBase *>(pWnd);
                if ( pDialog != NULL )
                {
                    pDialog->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXFrameWndBase *pFrame = dynamic_cast<CMCXFrameWndBase *>(pWnd);
                if ( pFrame != NULL )
                {
                    pFrame->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXMDIFrameWndBase *pMdiFrame = dynamic_cast<CMCXMDIFrameWndBase *>(pWnd);
                if ( pMdiFrame != NULL )
                {
                    pMdiFrame->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXMDIChildWndBase *pMdiChild = dynamic_cast<CMCXMDIChildWndBase *>(pWnd);
                if ( pMdiChild != NULL )
                {
                    pMdiChild->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXViewBase *pView = dynamic_cast<CMCXViewBase *>(pWnd);
                if ( pView != NULL )
                {
                    pView->SetContextMenu ( NULL );
                    return FALSE;
                }
            }

            //
            {
                CMCXCWndBase *pWndBase = dynamic_cast<CMCXCWndBase *>(pWnd);
                if ( pWndBase != NULL )
                {
                    pWndBase->SetContextMenu ( NULL );
                    return FALSE;
                }
            }


        }
    }

    //
    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::HandleSquareCorners ( CWnd *pWnd, BOOL bWithStyle )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    if ( CMCXColors::m_iSquareCorner == 1 )
    {
        if ( CMCXColors::m_iDarkTheme == 2 )
        {
            CMCXColors::SetWindowTheme ( pWnd );

            //  Remove System Menu
            if ( bWithStyle )
            {
                pWnd->ModifyStyle ( WS_SYSMENU, NULL, SWP_NOMOVE | SWP_NOSIZE | SWP_NOZORDER );
            }
            return TRUE;
        }
    }

    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::PopupSystemMenu ( CWnd *pWnd, UINT nHitTest, CPoint point, int darkIndicator )
{
    CMenu *pMenu = pWnd->GetSystemMenu(FALSE);
    if ( pMenu )
    {
        //
        {
            CMCXPropertySheetBase *pSheet = dynamic_cast<CMCXPropertySheetBase *>(pWnd);
            if ( pSheet != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pSheet->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        //
        {
            CMCXPropertyPageBase *pPage = dynamic_cast<CMCXPropertyPageBase *>(pWnd);
            if ( pPage != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pPage->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        //
        {
            CMCXDialogExBase *pDialogEx = dynamic_cast<CMCXDialogExBase *>(pWnd);
            if ( pDialogEx != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pDialogEx->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        {
            CMCXDialogBase *pDialog = dynamic_cast<CMCXDialogBase *>(pWnd);
            if ( pDialog != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pDialog->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        {
            CMCXFrameWndBase *pFrame = dynamic_cast<CMCXFrameWndBase *>(pWnd);
            if ( pFrame != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pFrame->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        {
            CMCXMDIFrameWndBase *pMdiFrame = dynamic_cast<CMCXMDIFrameWndBase *>(pWnd);
            if ( pMdiFrame != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pMdiFrame->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        {
            CMCXMDIChildWndBase *pMdiChild = dynamic_cast<CMCXMDIChildWndBase *>(pWnd);
            if ( pMdiChild != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pMdiChild->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        {
            CMCXCWndBase *pWndBase = dynamic_cast<CMCXCWndBase *>(pWnd);
            if ( pWndBase != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pWndBase->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

        {
            CMCXViewBase *pView = dynamic_cast<CMCXViewBase *>(pWnd);
            if ( pView != NULL )
            {
                CMCXMenuBase        menu;
                menu.Attach ( pMenu->m_hMenu );
                m_pContextMenu = menu.GetSubMenu ( 0 );
                pView->SetContextMenu ( m_pContextMenu );
                //  Use System Menu as Popup Menu
                LPARAM lParam = m_pContextMenu->TrackPopupMenu ( 
                    TPM_LEFTALIGN | TPM_LEFTBUTTON | TPM_RIGHTBUTTON /* | TPM_NONOTIFY */ | TPM_RETURNCMD, 
                    point.x, point.y, pWnd );
                if ( lParam ) 
                {
                    PostMessage(pWnd->GetSafeHwnd(), WM_SYSCOMMAND, lParam, 0);
                }
                menu.Detach ( );
                return TRUE;
            }
        }

