Ian-Macallan/WOE5Extract/WOE5Extract/MCXNCColor.cpp
    }

    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnNcRButtonDown( CWnd *pWnd, UINT nHitTest, CPoint point, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    if ( CMCXColors::m_iDarkTheme == 2 || CMCXColors::m_iDarkTheme == darkIndicator )
    {
        BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
        return bTreated;
    }

#if 0
    //  Default Behaviour : popup system menu in the caption
    return FALSE;
#endif

    //
    //  This make the menu appear when caption RButton Down
    {
        CMCXPropertySheetBase *pSheet = dynamic_cast<CMCXPropertySheetBase *>(pWnd);
        if ( pSheet != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    {
        CMCXPropertyPageBase *pPage = dynamic_cast<CMCXPropertyPageBase *>(pWnd);
        if ( pPage != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    {
        CMCXDialogExBase *pDialog = dynamic_cast<CMCXDialogExBase *>(pWnd);
        if ( pDialog != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    {
        CMCXDialogBase *pDialog = dynamic_cast<CMCXDialogBase *>(pWnd);
        if ( pDialog != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    {
        CMCXFrameWndBase *pFrame = dynamic_cast<CMCXFrameWndBase *>(pWnd);
        if ( pFrame != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    {
        CMCXFrameWndBase *pFrame = dynamic_cast<CMCXFrameWndBase *>(pWnd);
        if ( pFrame != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    {
        CMCXMDIFrameWndBase *pFrame = dynamic_cast<CMCXMDIFrameWndBase *>(pWnd);
        if ( pFrame != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    {
        CMCXMDIChildWndBase *pChild = dynamic_cast<CMCXMDIChildWndBase *>(pWnd);
        if ( pChild != NULL )
        {
            BOOL bTreated = PopupSystemMenu ( pWnd, nHitTest, point, darkIndicator );
            return bTreated;
        }
    }

    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnLButtonUp(CWnd *pWnd, UINT nFlags, CPoint point, int darkIndicator)
{
    m_bLeftPressed  = FALSE;
    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnNcMouseMove(CWnd *pWnd, UINT nHitTest, CPoint point, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    if ( CMCXColors::m_iDarkTheme == 2 || CMCXColors::m_iDarkTheme == darkIndicator )
    {
        TRACKMOUSEEVENT tme;
        ZeroMemory ( &tme, sizeof(tme) );
        tme.cbSize      = sizeof(tme);
        tme.hwndTrack   = pWnd->m_hWnd;
        tme.dwFlags     = TME_NONCLIENT  | TME_HOVER | TME_LEAVE;
        tme.dwHoverTime = 100; // HOVER_DEFAULT;
        TrackMouseEvent ( &tme );

        if ( m_bLeftPressed )
        {
            pWnd->SetWindowPos ( NULL, 
                m_windowRECT.left + point.x - m_LeftPressedPoint.x,
                m_windowRECT.top + point.y - m_LeftPressedPoint.y, 0, 0, SWP_NOSIZE | SWP_NOZORDER );
        }

    }

    //  Always returns FALSE to continue the process
    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnMouseMove(CWnd *pWnd, UINT nFlags, CPoint point, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    if ( CMCXColors::m_iDarkTheme == 2 || CMCXColors::m_iDarkTheme == darkIndicator )
    {
        //  Track Event
        TRACKMOUSEEVENT tme;
        ZeroMemory ( &tme, sizeof(tme) );
        tme.cbSize      = sizeof(tme);
        tme.hwndTrack   = pWnd->m_hWnd;
        tme.dwFlags     = TME_NONCLIENT  | TME_HOVER | TME_LEAVE;
        tme.dwHoverTime = HOVER_DEFAULT;
        TrackMouseEvent ( &tme );

        m_bLeftPressed  = FALSE;
    }

    //  Always returns FALSE to continue the process
    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
void CMCXNCColor::DrawAllIcons (  CWnd *pWnd, UINT iconOnly, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return;
	}

    if ( iconOnly == ICON_NOT_SET )
    {
        return;
    }

    //
    if ( CMCXColors::m_iDarkTheme != 2 && CMCXColors::m_iDarkTheme != darkIndicator )
    {
        return;
	}

    //
    DWORD dwStyle = pWnd->GetStyle();
    WINDOWPLACEMENT wp;
    pWnd->GetWindowPlacement( &wp );

    //
    CDC* pDC = GetDeviceContext ( pWnd );

    if ( iconOnly == 0 || iconOnly == IDI_CLOSE )
    {
        if ( IDI_CLOSE != VAL_CLOSE )
        {
            DrawIcon ( pDC, IDI_CLOSE, m_CloseRect );
        }
        else if ( hIcon_close_ico != NULL )
        {
            DrawIcon ( pDC, hIcon_close_ico, m_CloseRect );
        }
    }

    if ( iconOnly == 0 || iconOnly == IDI_MAXIMIZE || iconOnly == IDI_WINDOWED )
    {
        if ( dwStyle & WS_MAXIMIZEBOX )
        {
            if ( wp.showCmd == SW_NORMAL )
            {
                if ( IDI_MAXIMIZE != VAL_MAXIMIZE )
                {
                    DrawIcon ( pDC, IDI_MAXIMIZE, m_MaximizeRect );
                }
                else if ( hIcon_maximize_ico != NULL )
                {
                    DrawIcon ( pDC, hIcon_maximize_ico, m_MaximizeRect );
                }
            }
            else
            {
                if ( IDI_WINDOWED != VAL_WINDOWED )
                {
                    DrawIcon ( pDC, IDI_WINDOWED, m_MaximizeRect );
                }
                else if ( hIcon_windowed_ico != NULL )
                {
                    DrawIcon ( pDC, hIcon_windowed_ico, m_MaximizeRect );
                }
            }
        }
        else
        {
            DrawIconFrame ( pDC, m_MaximizeRect );
        }
    }

