Ian-Macallan/WOE5Extract/WOE5Extract/MCXNCColor.cpp
    if ( iconOnly == 0 || iconOnly == IDI_MINIMIZE )
    {
        if ( dwStyle & WS_MINIMIZEBOX )
        {
            if ( IDI_MINIMIZE != VAL_MINIMIZE )
            {
                DrawIcon ( pDC, IDI_MINIMIZE, m_MinimizeRect );
            }
            else if ( hIcon_minimize_ico != NULL )
            {
                DrawIcon ( pDC, hIcon_minimize_ico, m_MinimizeRect );
            }
        }
        else
        {
            DrawIconFrame ( pDC, m_MinimizeRect );
        }
    }

    pWnd->ReleaseDC ( pDC );

}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnNcMouseHover(CWnd *pWnd, UINT nFlags, CPoint point, int darkIndicator)
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    if ( CMCXColors::m_iDarkTheme != 2 && CMCXColors::m_iDarkTheme != darkIndicator )
    {
        return FALSE;
	}

    //  Always returns FALSE to continue the process
    if ( ScreenPointOverRect( pWnd, point, m_CloseRect ) )
    {
        if ( m_iHover != IDI_CLOSE )
        {
            DrawAllIcons ( pWnd, m_iHover );

            CDC* pDC = pWnd->GetWindowDC();
            if ( IDI_CLOSE != VAL_CLOSE )
            {
                DrawIcon ( pDC, IDI_CLOSE, m_CloseRect, true, CMCXColors::GetRedCBrush() );
            }
            else if ( hIcon_close_ico != NULL )
            {
                DrawIcon ( pDC, hIcon_close_ico, m_CloseRect, true, CMCXColors::GetRedCBrush() );
            }
            pWnd->ReleaseDC ( pDC );
            m_iHover    = IDI_CLOSE;
        }
        return FALSE;
    }
    else if ( ScreenPointOverRect( pWnd, point, m_MaximizeRect ) )
    {
        //
        DWORD dwStyle = pWnd->GetStyle();
        WINDOWPLACEMENT wp;
        pWnd->GetWindowPlacement( &wp );

        if ( m_iHover != IDI_MAXIMIZE )
        {
            DrawAllIcons ( pWnd, m_iHover );

            CDC* pDC = pWnd->GetWindowDC();
            if ( dwStyle & WS_MAXIMIZEBOX )
            {
                if ( wp.showCmd == SW_NORMAL )
                {
                    if ( IDI_MAXIMIZE != VAL_MAXIMIZE )
                    {
                        DrawIcon ( pDC, IDI_MAXIMIZE, m_MaximizeRect, true, CMCXColors::GetCyanCBrush() );
                    }
                    else if ( hIcon_maximize_ico != NULL )
                    {
                        DrawIcon ( pDC, hIcon_maximize_ico, m_MaximizeRect, true, CMCXColors::GetCyanCBrush() );
                    }
                }
                else
                {
                    if ( IDI_WINDOWED != VAL_WINDOWED )
                    {
                        DrawIcon ( pDC, IDI_WINDOWED, m_MaximizeRect, true, CMCXColors::GetCyanCBrush() );
                    }
                    else if ( hIcon_windowed_ico != NULL )
                    {
                        DrawIcon ( pDC, hIcon_windowed_ico, m_MaximizeRect, true, CMCXColors::GetCyanCBrush() );
                    }
                }
            }
            else
            {
                DrawIconFrame ( pDC, m_MaximizeRect, true, CMCXColors::GetBKNormalCBrush(CMCXColors::m_iDarkTheme != 0) );
            }
            pWnd->ReleaseDC ( pDC );
            m_iHover    = IDI_MAXIMIZE;
        }
        return FALSE;
    }
    else if ( ScreenPointOverRect( pWnd, point, m_MinimizeRect ) )
    {
        //
        DWORD dwStyle = pWnd->GetStyle();
        WINDOWPLACEMENT wp;
        pWnd->GetWindowPlacement( &wp );

        if ( m_iHover != IDI_MINIMIZE )
        {
            DrawAllIcons ( pWnd, m_iHover );

            CDC* pDC = pWnd->GetWindowDC();
            if ( dwStyle & WS_MINIMIZEBOX )
            {
                if ( IDI_MINIMIZE != VAL_MINIMIZE )
                {
                    DrawIcon ( pDC, IDI_MINIMIZE, m_MinimizeRect, true, CMCXColors::GetCyanCBrush() );
                }
                else if ( hIcon_minimize_ico ) 
                {
                    DrawIcon ( pDC, hIcon_minimize_ico, m_MinimizeRect, true, CMCXColors::GetCyanCBrush() );
                }
            }
            else
            {
                DrawIconFrame ( pDC, m_MinimizeRect, true, CMCXColors::GetBKNormalCBrush(CMCXColors::m_iDarkTheme != 0) );
            }
            pWnd->ReleaseDC ( pDC );
            m_iHover    = IDI_MINIMIZE;
        }
        return FALSE;
    }

    DrawAllIcons ( pWnd, m_iHover );
    m_iHover = ICON_NOT_SET;

    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::OnNcMouseLeave(CWnd *pWnd, int darkIndicator )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
		return FALSE;
	}

    //
    if ( CMCXColors::m_iDarkTheme != 2 && CMCXColors::m_iDarkTheme != darkIndicator )
    {
        return FALSE;
	}

    //  Always returns FALSE to continue the process
    DrawAllIcons ( pWnd, m_iHover );
    m_iHover        = ICON_NOT_SET;
    m_bLeftPressed  = FALSE;
    return FALSE;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
CMenu *CMCXNCColor::GetSystemMenu(CWnd *pWnd, BOOL bRevert )
{
	if ( CMCXWinAppBase::OSVersionLowerThan ( 6, 1 ) )
	{
        CMenu *pMenu  = pWnd->GetSystemMenu ( bRevert );
        return pMenu;
	}

    //
    if ( CMCXColors::m_iDarkTheme != 2 )
    {
        //
        CMenu *pMenu  = pWnd->GetSystemMenu ( bRevert );
        return pMenu;
    }

    //
    CMenu *pMenu  = pWnd->GetSystemMenu ( bRevert );
    return pMenu;

}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::InsertSystemMenu ( CWnd *pWnd, BOOL bRevert, UINT nPosition, UINT nFlags, UINT_PTR nIDNewItem, LPCTSTR lpszNewItem )
{
    BOOL bInserted = FALSE;

    CMenu *pMenu  = GetSystemMenu ( pWnd, bRevert );
    if ( pMenu != NULL )
    {
        bInserted = pMenu->InsertMenu ( nPosition, nFlags, nIDNewItem, lpszNewItem );
    }

    return bInserted;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
BOOL CMCXNCColor::AppendSystemMenu ( CWnd *pWnd, BOOL bRevert, UINT nFlags, UINT_PTR nIDNewItem, LPCTSTR lpszNewItem )
{
    BOOL bAppended = FALSE;

    CMenu *pMenu  = GetSystemMenu ( pWnd, bRevert );
    if ( pMenu != NULL )
    {
        bAppended = pMenu->AppendMenu ( nFlags, nIDNewItem, lpszNewItem );
    }

    return bAppended;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
UINT CMCXNCColor::CheckSystemMenuItem ( CWnd *pWnd, BOOL bRevert, UINT nIDCheckItem, UINT nCheck )
{
    UINT result = 0;
    CMenu *pMenu  = GetSystemMenu ( pWnd, bRevert );
    if ( pMenu != NULL )
    {
        result = pMenu->CheckMenuItem ( nIDCheckItem, nCheck );
    }
    return result;
}

//
/////////////////////////////////////////////////////////////////////////////
//
/////////////////////////////////////////////////////////////////////////////
UINT CMCXNCColor::GetSystemMenuState ( CWnd *pWnd, BOOL bRevert, UINT nID, UINT nFlags )
{
    UINT result = 0;
    CMenu *pMenu  = GetSystemMenu ( pWnd, bRevert );
    if ( pMenu != NULL )
    {
        result = pMenu->GetMenuState ( nID, nFlags );
    }

    return result;
}
